---
kind: type
id: T:Autodesk.Revit.DB.Visual.CeramicPatternType
source: html/e731e70d-85ff-6c83-8b4b-be09e6affdf2.htm
---
# Autodesk.Revit.DB.Visual.CeramicPatternType

The enumerated type representing the permitted values for the asset property "CeramicPattern" from the "Ceramic" schema.

## Syntax (C#)
```csharp
public enum CeramicPatternType
```